docs: improve the documentation
